{
  "irVersion": "1.0",
  "project": "gqlforge",
  "repository": "https://github.com/grokify/gqlforge",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-06-07",
      "commit": "10ebd97",
      "highlights": [
        { "description": "Operation scaffolding from schema Query/Mutation types" },
        { "description": "Schema validation and drift detection" },
        { "description": "File watching with auto-regeneration" },
        { "description": "Embedded genqlient (no CLI installation required)" }
      ],
      "added": [
        { "description": "`scaffold` command to generate stub operations from schema types", "commit": "8ce91db" },
        { "description": "Support --type, --depth, --include, --exclude flags for scaffold filtering", "commit": "8ce91db" },
        { "description": "scaffold package with Generator for operation generation", "commit": "8ce91db" },
        { "description": "`validate` command to check operations against schema", "commit": "3e3eb81" },
        { "description": "Support --strict mode and --json output for validation", "commit": "3e3eb81" },
        { "description": "`diff` command to compare local schema to remote endpoint", "commit": "0c63281" },
        { "description": "Detect added/removed types and fields with breaking change identification", "commit": "0c63281" },
        { "description": "Support --breaking-only and --json output for diff", "commit": "0c63281" },
        { "description": "`watch` command for auto-regeneration on file changes", "commit": "bbd943b" },
        { "description": "Debounced file watching with fsnotify", "commit": "bbd943b" }
      ],
      "changed": [
        { "description": "`generate` command now uses genqlient as embedded library instead of exec", "commit": "303bb53", "breaking": true },
        { "description": "genqlient CLI no longer required to be installed separately", "commit": "303bb53" }
      ],
      "dependencies": [
        { "description": "github.com/Khan/genqlient v0.8.1 (direct, embedded generation)", "commit": "b387445" },
        { "description": "github.com/vektah/gqlparser/v2 v2.5.33 (direct, validation)", "commit": "b387445" },
        { "description": "github.com/fsnotify/fsnotify v1.10.1 (direct, watch command)", "commit": "b387445" },
        { "description": "github.com/bmatcuk/doublestar/v4 v4.10.0 (direct, glob patterns)", "commit": "b387445" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-06-07",
      "commit": "4498216",
      "highlights": [
        { "description": "GraphQL client SDK generator for Go using genqlient" },
        { "description": "Schema introspection with SDL and JSON output" },
        { "description": "goauth integration for flexible authentication" }
      ],
      "added": [
        { "description": "GraphQL introspection package with SDL conversion", "commit": "25245ed" },
        { "description": "Introspection client supporting bearer tokens and goauth credentials", "commit": "25245ed" },
        { "description": "ToSDL() method for converting introspection result to Schema Definition Language", "commit": "25245ed" },
        { "description": "ToJSON() method for raw introspection result export", "commit": "25245ed" },
        { "description": "CLI root command with global flags: --creds, --account, --output, --verbose", "commit": "749b000" },
        { "description": "`introspect` command to fetch GraphQL schema from endpoints", "commit": "823b6f7" },
        { "description": "Authentication via goauth credentials file or bearer token", "commit": "823b6f7" },
        { "description": "Output formats: SDL (.graphql) and JSON (.json)", "commit": "823b6f7" },
        { "description": "`init` command to scaffold genqlient project structure", "commit": "174d06a" },
        { "description": "Project scaffolding creates genqlient.yaml, schema.graphql, operations/, generated/", "commit": "174d06a" },
        { "description": "`generate` command wrapping genqlient for code generation", "commit": "f3d9c14" },
        { "description": "`version` command for displaying version information", "commit": "44678d8" }
      ],
      "documentation": [
        { "description": "README with workflow documentation: introspect → define operations → generate", "commit": "ab18d3a" },
        { "description": "Usage examples for all CLI commands", "commit": "ab18d3a" }
      ],
      "dependencies": [
        { "description": "github.com/spf13/cobra for CLI framework", "commit": "4498216" },
        { "description": "github.com/grokify/goauth for authentication", "commit": "4498216" }
      ]
    }
  ]
}
